import React from 'react';
import { graphql } from 'gatsby';
import { config, useSpring } from 'react-spring';
import Img from 'gatsby-image';
import styled from 'styled-components';
import Layout from '../components/layout';
import { AnimatedBox } from '../elements';
import SEO from '../components/SEO';

export const AnimatedBoxAbout = styled(AnimatedBox)`
	p {
		margin:0;
		line-height: 2.3rem;
	}
`;

const About = ({ data: { aboutUs } }) => {
	const pageAnimation = useSpring({
		config: config.slow,
		from: { opacity: 0 },
		to: { opacity: 1 }
	});

	return (
		<Layout>
			<SEO
				title="За Нас | Моята Приказна Книга"
				desc="В една нощ приказна, небето бе отрупано с ярко светещи звезди. Все едно една от тях падна и в съня ми спокоен се настани."
			/>
			<AnimatedBoxAbout style={pageAnimation} py={[ 6, 6, 6, 8 ]} px={[ 6, 6, 8, 6, 8, 13 ]}>
				<h1>Моята Приказна Книга</h1>
				<p>
					&nbsp;&nbsp;&nbsp;&nbsp;В една нощ приказна, небето бе отрупано с ярко светещи звезди. Все едно една
					от тях падна и в съня ми спокоен се настани. Чудо, а може би магия ще го наречете. Аз го нарекох
					съдба.
				</p>
				<p>
					&nbsp;&nbsp;&nbsp;&nbsp;В съня си видях книгата в този вид подредена: кратко послание, приказни
					герои и спомени, в снимки отразени. Събудих се, не можах да разбера реално ли е това. Набавих си
					необходимите материали и започнах да творя. С усмивка на лице и развълнувано сърце, сътворих първата
					си красота.
				</p>
				<p>
					&nbsp;&nbsp;&nbsp;&nbsp;Нарекох я Приказна Книга, защото случващото се определих наистина като
					приказка: толкова красива, докосваща душата, изпълваща очите с блясък, докосваща сърцето с любов.
				</p>
				<p>
					&nbsp;&nbsp;&nbsp;&nbsp;Повярвах в себе си и сбъднах една мечта, която се бе зародила в съня.
					Сътворих Приказни Книги уникални, единствени и неповторими в света. Създадох нещо, което няма да
					изчезне във времето. Създадох Спомен, за цял живот!
				</p>
				<p>
					&nbsp;&nbsp;&nbsp;&nbsp;Когато вземеш в ръце своята Приказна Книга, Ти не държиш просто вещ. Ти
					получаваш часове, дни и седмици на истински радост и щастие. Получаваш част от сърцето ми и мигове
					от живота ми. Получаваш старанието, въображението и част от душата ми!
				</p>
				<h5>Христина Петрова</h5>
				<Img fluid={aboutUs.childImageSharp.fluid} />
				<br /> <br />
				<p>
					&nbsp;&nbsp;&nbsp;&nbsp;Приказната Книга е създадена изцяло от естествени материали. Кутията се
					изработва от дърво – липа и бял бор. Обработва се с пречистените масла, съдържащи естествени
					съставки, на фирма OSMO. Текстът, рамките за снимките и всички декорации са изрязани от дърво – липа
					и бреза. Обработват се с безароматни и безвредни бои, създадени на базата на естествени оцветители.
				</p>
				<p>
					&nbsp;&nbsp;&nbsp;&nbsp;Както във всяка приказка, моите книги имат главни герои. В кутиите те са
					илюстрирани чрез мечета и зайчета. Декорациите се изработват индивидуално за всяка книга, според
					повода и според любимите занимания на главния герой.
				</p>
				<p>
					&nbsp;&nbsp;&nbsp;&nbsp;Във всяка приказна книга, разказът е съпроводен от картинки, които засилват
					емоцията му. В моите книги се поставят снимки, за да въздействат още по-силно на посланието, което е
					изписано вътре. За да върнат главния герой към преживян незабравим миг.
				</p>
				<p>
					&nbsp;&nbsp;&nbsp;&nbsp;Приказните Книги са подходящ подарък за всеки повод и дори без повод.
					Изработват се по желание на клиента. Изборът на цветовете, броя на снимките, посланието, приказните
					герои и декорациите са във ваши ръце. Всяка книга, пристига при вас в брандирана опаковъчна кутия и
					брандирана подаръчна торбичка.
				</p>
				<p>
					&nbsp;&nbsp;&nbsp;&nbsp;Книгата може да бъде чудесен аксесоар към интериора на всяка стая, както и
					към декора за всяко едно тържество. Книгата може да бъде и рекламната визитка на всяка фирма, хотел,
					ресторант, салон за красота и други.
				</p>
				<p>
					&nbsp;&nbsp;&nbsp;&nbsp;Книгата е подарък, който няма да загуби своята стойност с времето.
					Приказната Книга вълнува, поражда сълзи от радост, провокира множество усмивки.
				</p>
			</AnimatedBoxAbout>
		</Layout>
	);
};

export default About;

export const query = graphql`
	query About {
		aboutUs: file(sourceInstanceName: { eq: "images" }, name: { eq: "about" }) {
			childImageSharp {
				fluid(quality: 95, maxWidth: 1200) {
					...GatsbyImageSharpFluid_withWebp
				}
			}
		}
	}
`;
